In [2]:
import numpy as np
import pandas as pd

In [3]:
lis=['one','two','three']
m=[10,20,30]
arr=np.array(m)
d={'one':10,'two':20,'three':30}

In [4]:
pd.Series(data=lis)

0      one
1      two
2    three
dtype: object

In [13]:
pd.Series(data=lis, index=m)

10      one
20      two
30    three
dtype: object

In [14]:
pd.Series(d)

one      10
two      20
three    30
dtype: int64

In [18]:
pd.Series(data=[sum,sum])

0    <built-in function sum>
1    <built-in function sum>
dtype: object

In [5]:
ser1=pd.Series(['okay','okay2','dum','dooooo'],[1,3,4,5])

In [24]:
ser2=pd.Series(['wat','okay2','dum','dooooo','oka'],[1,3,4,5,0])

In [6]:
ser1

1      okay
3     okay2
4       dum
5    dooooo
dtype: object

In [31]:
ser1+ser2

0             NaN
1         okaywat
3      okay2okay2
4          dumdum
5    dooooodooooo
dtype: object

dataframe

In [32]:
from numpy.random import randn
np.random.seed(101)

In [35]:
a=randn(5,4)
a

array([[ 0.30266545,  1.69372293, -1.70608593, -1.15911942],
       [-0.13484072,  0.39052784,  0.16690464,  0.18450186],
       [ 0.80770591,  0.07295968,  0.63878701,  0.3296463 ],
       [-0.49710402, -0.7540697 , -0.9434064 ,  0.48475165],
       [-0.11677332,  1.9017548 ,  0.23812696,  1.99665229]])

In [40]:
df=pd.DataFrame(randn(5,4),['ind1','ind2','ind3','ind4','ind5'],['col1','col2','col3','col4'])
df

          col1      col2      col3      col4
ind1  1.606780 -1.115710 -1.385379 -1.329660
ind2  0.041460 -0.411055 -0.771329  0.110477
ind3 -0.804652  0.253548  0.649148  0.358941
ind4 -1.080471  0.902398  0.161781  0.833029
ind5  0.975720 -0.388239  0.783316 -0.708954

In [50]:
df[['col3','col4']]

          col3      col4
ind1 -1.385379 -1.329660
ind2 -0.771329  0.110477
ind3  0.649148  0.358941
ind4  0.161781  0.833029
ind5  0.783316 -0.708954

In [54]:
df['col5']=df['col3']+df['col2']
df

          col1      col2      col3      col4      col5
ind1  1.606780 -1.115710 -1.385379 -1.329660 -2.501089
ind2  0.041460 -0.411055 -0.771329  0.110477 -1.182384
ind3 -0.804652  0.253548  0.649148  0.358941  0.902696
ind4 -1.080471  0.902398  0.161781  0.833029  1.064179
ind5  0.975720 -0.388239  0.783316 -0.708954  0.395077

In [60]:
df.drop('col1',axis=1,inplace=True)

In [63]:
df.drop('ind3',axis=0,inplace=True)

In [64]:
df

          col2      col3      col4      col5
ind1 -1.115710 -1.385379 -1.329660 -2.501089
ind2 -0.411055 -0.771329  0.110477 -1.182384
ind4  0.902398  0.161781  0.833029  1.064179
ind5 -0.388239  0.783316 -0.708954  0.395077

In [65]:
df.shape

(4, 4)

In [69]:
df.iloc[2]

col2    0.902398
col3    0.161781
col4    0.833029
col5    1.064179
Name: ind4, dtype: float64

In [74]:
df.iloc[0,2]

-1.3296600588247933

In [76]:
df.loc[['ind2','ind5'],['col2','col4']]

          col2      col4
ind2 -0.411055  0.110477
ind5 -0.388239 -0.708954

conditional

In [77]:
df[df>0]

          col2      col3      col4      col5
ind1       NaN       NaN       NaN       NaN
ind2       NaN       NaN  0.110477       NaN
ind4  0.902398  0.161781  0.833029  1.064179
ind5       NaN  0.783316       NaN  0.395077

In [78]:
df

          col2      col3      col4      col5
ind1 -1.115710 -1.385379 -1.329660 -2.501089
ind2 -0.411055 -0.771329  0.110477 -1.182384
ind4  0.902398  0.161781  0.833029  1.064179
ind5 -0.388239  0.783316 -0.708954  0.395077

In [79]:
df>0

       col2   col3   col4   col5
ind1  False  False  False  False
ind2  False  False   True  False
ind4   True   True   True   True
ind5  False   True  False   True

In [82]:
result=df[df['col4']>0]

In [85]:
result.drop('ind2',axis=0,inplace=True)

/home/shubhangi/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:3940: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  errors=errors)

In [88]:
df.reset_index(inplace=True)

In [89]:
df

  index      col2      col3      col4      col5
0  ind1 -1.115710 -1.385379 -1.329660 -2.501089
1  ind2 -0.411055 -0.771329  0.110477 -1.182384
2  ind4  0.902398  0.161781  0.833029  1.064179
3  ind5 -0.388239  0.783316 -0.708954  0.395077

In [90]:
df['ind']='cd my mu li'.split()

In [91]:
df

  index      col2      col3      col4      col5 ind
0  ind1 -1.115710 -1.385379 -1.329660 -2.501089  cd
1  ind2 -0.411055 -0.771329  0.110477 -1.182384  my
2  ind4  0.902398  0.161781  0.833029  1.064179  mu
3  ind5 -0.388239  0.783316 -0.708954  0.395077  li

In [92]:
df.set_index('ind',inplace=True)

In [93]:
df

    index      col2      col3      col4      col5
ind
cd   ind1 -1.115710 -1.385379 -1.329660 -2.501089
my   ind2 -0.411055 -0.771329  0.110477 -1.182384
mu   ind4  0.902398  0.161781  0.833029  1.064179
li   ind5 -0.388239  0.783316 -0.708954  0.395077

missing data

In [7]:
d={'A':[1,2,np.nan],'B':[2,np.nan,np.nan],'C':[7,8,9]}

In [8]:
df=pd.DataFrame(d)

In [9]:
df

     A    B  C
0  1.0  2.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [10]:
df.dropna(axis=1)

   C
0  7
1  8
2  9

In [15]:
df.dropna(thresh=3)

     A    B  C
0  1.0  2.0  7

In [16]:
df.fillna(value="ok")

    A   B  C
0   1   2  7
1   2  ok  8
2  ok  ok  9

In [20]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [21]:
df

     A    B  C
0  1.0  2.0  7
1  2.0  NaN  8
2  1.5  NaN  9

In [22]:
df.fillna(value=df.mean())

     A    B  C
0  1.0  2.0  7
1  2.0  2.0  8
2  1.5  2.0  9

groupby

In [23]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [24]:
df= pd.DataFrame(data)

In [25]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [27]:
bycomp=df.groupby("Company")

In [29]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [32]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [34]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [44]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [41]:
df.groupby("Company").min().loc['MSFT']

Person    Amy
Sales     124
Name: MSFT, dtype: object

# operations

In [7]:
m=pd.DataFrame({'col1':[2,4,6,6],'col2':[345,678,345,667],'col3':['defg','abc','eeqw','defg']})

In [8]:
m

   col1  col2  col3
0     2   345  defg
1     4   678   abc
2     6   345  eeqw
3     6   667  defg

In [9]:
len(m['col2'].unique())

3

In [10]:
m['col3'].nunique()

3

In [11]:
m['col1'].value_counts()

6    2
2    1
4    1
Name: col1, dtype: int64

In [12]:
m[(m['col2']>345) | (m['col1']>4)]

   col1  col2  col3
1     4   678   abc
2     6   345  eeqw
3     6   667  defg

In [13]:
m['col2']>345

0    False
1     True
2    False
3     True
Name: col2, dtype: bool

In [14]:
def times3(x):
    return x*3

In [15]:
m['col2'].apply(times3)

0    1035
1    2034
2    1035
3    2001
Name: col2, dtype: int64

In [16]:
m['col3'].apply(len)

0    4
1    3
2    4
3    4
Name: col3, dtype: int64

In [17]:
m['col2'].apply(lambda x:x**2)

0    119025
1    459684
2    119025
3    444889
Name: col2, dtype: int64

In [77]:
m.index

RangeIndex(start=0, stop=4, step=1)

In [80]:
m.sort_values('col2')

   col1  col2  col3
0     2   345  defg
2     6   345  eeqw
3     6   667  defg
1     4   678   abc

In [82]:
m.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [83]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [84]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [89]:
df.pivot_table(values='D',index=['A','B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [109]:
df= pd.read_csv("example")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [94]:
df.to_csv("output",index=False)

In [95]:
pd.read_csv("output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [100]:
pd.read_excel("Excel_Sample.xlsx")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [101]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [103]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","June 18, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"

In [104]:
from sqlalchemy import create_engine

In [107]:
engine=create_engine('sqlite:///:memory:')

In [110]:
df.to_sql('my_table',engine)

In [113]:
sqldf=pd.read_sql('my_table',con=engine)

In [114]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15